Repository: shoulderBlazer/uBillz_app
Catalog: lib/l10n/app_*.arb
Languages: ar, es, hi, ja, pt, ru, zh

# enableBiometricLoginTitle
source: Enable Biometric Login?
ar: تمكين تسجيل الدخول بالبصمة؟
es: ¿Activar inicio de sesión biométrico?
hi: बायोमेट्रिक लॉगिन सक्षम करें?
ja: 生体認証ログインを有効にしますか？
pt: Ativar login biométrico?
ru: Включить вход по биометрии?
zh: 启用生物识别登录？

# enableBiometricLoginContent
source: Use your biometrics for faster, more secure login.
ar: استخدم بصمتك لتسجيل دخول أسرع وأكثر أمانًا.
es: Use sus datos biométricos para un inicio de sesión más rápido y seguro.
hi: तेज़, अधिक सुरक्षित लॉगिन के लिए अपने बायोमेट्रिक्स का उपयोग करें।
ja: より速く、より安全なログインのために生体認証を使用してください。
pt: Use sua biometria para um login mais rápido e seguro.
ru: Используйте свои биометрические данные для более быстрого и безопасного входа.
zh: 使用您的生物识别信息进行更快、更安全的登录。

# biometricsEnabledSuccess
source: Biometrics enabled successfully!
ar: تم تمكين البصمة بنجاح!
es: ¡Biometría activada con éxito!
hi: बायोमेट्रिक्स सफलतापूर्वक सक्षम हो गया!
ja: 生体認証が正常に有効になりました！
pt: Biometria ativada com sucesso!
ru: Биометрия успешно включена!
zh: 生物识别已成功启用！

# biometricsEnableError
source: Could not enable biometrics. Please try again.
ar: تعذر تمكين البصمة. يرجى المحاولة مرة أخرى.
es: No se pudo activar la biometría. Por favor, inténtelo de nuevo.
hi: बायोमेट्रिक्स सक्षम नहीं किया जा सका। कृपया पुनः प्रयास करें।
ja: 生体認証を有効にできませんでした。もう一度お試しください。
pt: Não foi possível ativar a biometria. Por favor, tente novamente.
ru: Не удалось включить биометрию. Пожалуйста, попробуйте еще раз.
zh: 无法启用生物识别。请再试一次。

# biometricErrorNotEnrolled
source: No biometrics enrolled. Please set up biometrics in your device settings.
ar: لا توجد بصمات مسجلة. يرجى إعداد البصمات في إعدادات جهازك.
es: No hay datos biométricos registrados. Por favor, configure los datos biométricos en los ajustes de su dispositivo.
hi: कोई बायोमेट्रिक्स नामांकित नहीं है। कृपया अपनी डिवाइस सेटिंग्स में बायोमेट्रिक्स सेट करें।
ja: 生体認証が登録されていません。デバイスの設定で生体認証を設定してください。
pt: Nenhuma biometria cadastrada. Por favor, configure a biometria nas configurações do seu dispositivo.
ru: Биометрические данные не зарегистрированы. Пожалуйста, настройте биометрию в настройках вашего устройства.
zh: 未注册生物识别信息。请在您的设备设置中设置生物识别。

# biometricErrorLockedOut
source: Biometric authentication is temporarily locked due to too many failed attempts.
ar: تم قفل المصادقة بالبصمة مؤقتًا بسبب كثرة المحاولات الفاشلة.
es: La autenticación biométrica está bloqueada temporalmente debido a demasiados intentos fallidos.
hi: बहुत अधिक असफल प्रयासों के कारण बायोमेट्रिक प्रमाणीकरण अस्थायी रूप से लॉक हो गया है।
ja: 試行回数が多すぎるため、生体認証は一時的にロックされています。
pt: A autenticação biométrica está temporariamente bloqueada devido a muitas tentativas falhas.
ru: Биометрическая аутентификация временно заблокирована из-за слишком большого количества неудачных попыток.
zh: 由于失败次数过多，生物识别认证已暂时锁定。

# biometricErrorPermanentlyLockedOut
source: Biometric authentication is permanently locked. Please use your PIN and re-enable biometrics in settings.
ar: تم قفل المصادقة بالبصمة بشكل دائم. يرجى استخدام رمز PIN الخاص بك وإعادة تمكين البصمات في الإعدادات.
es: La autenticación biométrica está bloqueada permanentemente. Por favor, use su PIN y vuelva a activar la biometría en los ajustes.
hi: बायोमेट्रिक प्रमाणीकरण स्थायी रूप से लॉक हो गया है। कृपया अपने पिन का उपयोग करें और सेटिंग्स में बायोमेट्रिक्स को फिर से सक्षम करें।
ja: 生体認証は永久にロックされています。PINを使用し、設定で生体認証を再度有効にしてください。
pt: A autenticação biométrica está permanentemente bloqueada. Por favor, use seu PIN e reative a biometria nas configurações.
ru: Биометрическая аутентификация навсегда заблокирована. Пожалуйста, используйте свой PIN-код и снова включите биометрию в настройках.
zh: 生物识别认证已永久锁定。请使用您的PIN码并在设置中重新启用生物识别。

# biometricErrorNotAvailable
source: Biometrics are not available on this device.
ar: البصمات غير متوفرة على هذا الجهاز.
es: La biometría no está disponible en este dispositivo.
hi: इस डिवाइस पर बायोमेट्रिक्स उपलब्ध नहीं है।
ja: このデバイスでは生体認証は利用できません。
pt: A biometria não está disponível neste dispositivo.
ru: Биометрия недоступна на этом устройстве.
zh: 此设备上无法使用生物识别。

# biometricErrorPasscodeNotSet
source: No passcode is set. Please set a passcode on your device to use biometrics.
ar: لم يتم تعيين رمز مرور. يرجى تعيين رمز مرور على جهازك لاستخدام البصمات.
es: No se ha establecido ninguna contraseña. Por favor, establezca una contraseña en su dispositivo para usar la biometría.
hi: कोई पासकोड सेट नहीं है। बायोमेट्रिक्स का उपयोग करने के लिए कृपया अपने डिवाइस पर एक पासकोड सेट करें।
ja: パスコードが設定されていません。生体認証を使用するには、デバイスでパスコードを設定してください。
pt: Nenhuma senha definida. Por favor, defina uma senha no seu dispositivo para usar a biometria.
ru: Пароль не установлен. Пожалуйста, установите пароль на вашем устройстве, чтобы использовать биометрию.
zh: 未设置密码。请在您的设备上设置密码以使用生物识别。

# biometricErrorAuthFailed
source: Biometric authentication failed. Please try again.
ar: فشلت المصادقة بالبصمة. يرجى المحاولة مرة أخرى.
es: Falló la autenticación biométrica. Por favor, inténtelo de nuevo.
hi: बायोमेट्रिक प्रमाणीकरण विफल रहा। कृपया पुनः प्रयास करें।
ja: 生体認証に失敗しました。もう一度お試しください。
pt: A autenticação biométrica falhou. Por favor, tente novamente.
ru: Биометрическая аутентификация не удалась. Пожалуйста, попробуйте еще раз.
zh: 生物识别认证失败。请再试一次。

# biometricNoAuthError
source: Please set up your PIN first before using biometrics.
ar: يرجى إعداد رمز PIN الخاص بك أولاً قبل استخدام البصمة.
ja: 生体認証を使用する前に、まずPINを設定してください。
zh: 请先设置您的PIN码，然后再使用生物识别。

# pinInvalidLengthError
source: Please enter a 4-digit PIN
ar: الرجاء إدخال رمز PIN مكون من 4 أرقام
es: Por favor, ingrese un PIN de 4 dígitos
hi: कृपया 4 अंकों का पिन दर्ज करें
ja: 4桁のPINを入力してください
pt: Por favor, insira um PIN de 4 dígitos
ru: Пожалуйста, введите 4-значный PIN-код
zh: 请输入4位数的PIN码

# pinInvalidError
source: Invalid PIN. Please try again.
ar: رمز PIN غير صالح. يرجى المحاولة مرة أخرى.
es: PIN inválido. Por favor, inténtelo de nuevo.
hi: अमान्य पिन। कृपया पुनः प्रयास करें।
ja: 無効なPINです。もう一度お試しください。
pt: PIN inválido. Por favor, tente novamente.
ru: Неверный PIN-код. Пожалуйста, попробуйте еще раз.
zh: PIN码无效。请再试一次。

# authenticationError
source: Error during authentication: {error}
ar: خطأ أثناء المصادقة: {error}
es: Error durante la autenticación: {error}
hi: प्रमाणीकरण के दौरान त्रुटि: {error}
ja: 認証中にエラーが発生しました：{error}
pt: Erro durante a autenticação: {error}
ru: Ошибка во время аутентификации: {error}
zh: 认证过程中出错：{error}

source: Welcome Back!
ar: مرحبا بعودتك!
es: ¡Bienvenido de nuevo!
hi: वापस स्वागत है!
ja: おかえりなさい！
pt: Bem-vindo de volta!
ru: С возвращением!
zh: 欢迎回来！

# helloUser
source: Hello, {userName}!
ar: أهلاً، {userName}!
es: ¡Hola, {userName}!
hi: नमस्ते, {userName}!
ja: こんにちは、{userName}さん！
pt: Olá, {userName}!
ru: Привет, {userName}!
zh: 你好，{userName}！

# pinOrBiometricsPrompt
source: Enter PIN or use biometrics
ar: أدخل رمز PIN أو استخدم البصمة
es: Ingrese PIN o use datos biométricos
hi: पिन दर्ज करें या बायोमेट्रिक्स का उपयोग करें
ja: PINを入力するか、生体認証を使用してください
pt: Insira o PIN ou use a biometria
ru: Введите PIN-код или используйте биометрию
zh: 输入PIN码或使用生物识别

# pinPrompt
source: Enter your PIN
ar: أدخل رمز PIN الخاص بك
es: Ingrese su PIN
hi: अपना पिन दर्ज करें
ja: PINを入力してください
pt: Insira seu PIN
ru: Введите ваш PIN-код
zh: 输入您的PIN码

# biometricAuthTooltip
source: Use biometric authentication
ar: استخدام المصادقة بالبصمة
es: Usar autenticación biométrica
hi: बायोमेट्रिक प्रमाणीकरण का उपयोग करें
ja: 生体認証を使用する
pt: Usar autenticação biométrica
ru: Использовать биометрическую аутентификацию
zh: 使用生物识别认证

source: Login
ar: تسجيل الدخول
es: Iniciar sesión
hi: लॉग इन करें
ja: ログイン
ru: Войти
zh: 登录

source: Enable Biometrics
ar: تمكين البصمة
es: Activar Biometría
hi: बायोमेट्रिक्स सक्षम करें
ja: 生体認証を有効にする
pt: Ativar Biometria
ru: Включить биометрию
zh: 启用生物识别

source: Good Morning
ar: صباح الخير
es: Buenos días
hi: सुप्रभात
ja: おはようございます
pt: Bom dia
ru: Доброе утро
zh: 早上好

source: Good Afternoon
ar: مساء الخير
es: Buenas tardes
hi: नमस्कार
ja: こんにちは
pt: Boa tarde
ru: Добрый день
zh: 下午好

source: Good evening
ar: مساء الخير
es: Buenas noches
hi: शुभ संध्या
ja: こんばんは
pt: Boa noite
ru: Добрый вечер
zh: 晚上好

source: Currency Settings
ar: إعدادات العملة
es: Configuración de moneda
hi: मुद्रा सेटिंग्स
ja: 通貨設定
pt: Configurações de moeda
ru: Настройки валюты
zh: 货币设置

source: Language Settings
ar: إعدادات اللغة
es: Configuración de idioma
hi: भाषा सेटिंग्स
ja: 言語設定
pt: Configurações de idioma
ru: Настройки языка
zh: 语言设置

# yourPayments
source: Your Payments: {total}
ar: مدفوعاتك: {total}
es: Sus Pagos: {total}
hi: आपके भुगतान: {total}
ja: お支払い：{total}
pt: Seus Pagamentos: {total}
ru: Ваши платежи: {total}
zh: 您的付款：{total}

# paymentsDueToday
source: You have {count} payment(s) due today of {total}
ar: لديك {count} دفعة مستحقة اليوم بقيمة {total}
es: Tiene {count} pago(s) pendiente(s) para hoy de {total}
hi: आज आपके {count} भुगतान {total} के देय हैं
ja: 本日、{total}の{count}件の支払いがあります
pt: Você tem {count} pagamento(s) vencendo hoje de {total}
ru: У вас {count} платеж(а) на сегодня на сумму {total}
zh: 您今天有 {count} 笔 {total} 的付款

# noPaymentsDueToday
source: You have no payments due today
ar: ليس لديك أي مدفوعات مستحقة اليوم
es: No tiene pagos pendientes para hoy
hi: आज आपका कोई भुगतान देय नहीं है
ja: 本日期日の支払いありません
pt: Você não tem pagamentos vencendo hoje
ru: У вас нет платежей на сегодня
zh: 您今天没有到期的付款

source: This month's payment(s):
ar: مدفوعات هذا الشهر:
es: Pago(s) de este mes:
hi: इस महीने के भुगतान:
ja: 今月の支払い：
pt: Pagamento(s) deste mês:
ru: Платеж(и) в этом месяце:
zh: 本月付款：

source: Upcoming Payments
ar: المدفوعات القادمة
es: Próximos Pagos
hi: आगामी भुगतान
ja: 今後の支払い
pt: Próximos Pagamentos
ru: Предстоящие платежи
zh: 即将到来的付款

# upcomingPaymentsList
source: A list of your upcoming payments:
ar: قائمة بالمدفوعات القادمة:
es: Una lista de sus próximos pagos:
hi: आपके आगामी भुगतानों की एक सूची:
ja: 今後の支払いのリスト：
pt: Uma lista de seus próximos pagamentos:
ru: Список ваших предстоящих платежей:
zh: 您即将到来的付款列表：

source: No upcoming payments
ar: لا توجد مدفوعات قادمة
es: No hay próximos pagos
hi: कोई आगामी भुगतान नहीं
ja: 今後の支払いはありません
pt: Nenhum pagamento próximo
ru: Нет предстоящих платежей
zh: 没有即将到来的付款

source: Add Payment
ar: إضافة دفعة
es: Añadir Pago
hi: भुगतान जोड़ें
ja: 支払いを追加
pt: Adicionar Pagamento
ru: Добавить платеж
zh: 添加付款

source: View All Payments
ar: عرض كل المدفوعات
es: Ver todos los pagos
hi: सभी भुगतान देखें
ja: すべての支払いを表示
pt: Ver todos os pagamentos
ru: Просмотреть все платежи
zh: 查看所有付款

source: All Payments
ar: كل المدفوعات
es: Todos los pagos
hi: सभी भुगतान
ja: すべての支払い
pt: Todos os pagamentos
ru: Все платежи
zh: 所有付款

# noPaymentsMessage
source: You have no payments
ar: ليس لديك أي مدفوعات
es: No tiene pagos
hi: आपके कोई भुगतान नहीं हैं
ja: 支払いはありません
pt: Você não tem pagamentos
ru: У вас нет платежей
zh: 您没有付款

# addPaymentPrompt
source: Add a new payment from the dashboard.
ar: أضف دفعة جديدة من لوحة التحكم.
es: Añada un nuevo pago desde el panel.
hi: डैशबोर्ड से एक नया भुगतान जोड़ें।
ja: ダッシュボードから新しい支払いを追加してください。
pt: Adicione um novo pagamento a partir do painel.
ru: Добавьте новый платеж с панели управления.
zh: 从仪表板添加新的付款。

source: Settings
ar: الإعدادات
es: Configuración
hi: सेटिंग्स
ja: 設定
pt: Configurações
ru: Настройки
zh: 设置

source: Logout
ar: تسجيل الخروج
es: Cerrar sesión
hi: लॉग आउट
ja: ログアウト
pt: Sair
ru: Выйти
zh: 登出

# currencyUpdated
source: Currency updated to {currencyCode}
ar: تم تحديث العملة إلى {currencyCode}
es: Moneda actualizada a {currencyCode}
hi: मुद्रा {currencyCode} में अद्यतन की गई
ja: 通貨が{currencyCode}に更新されました
pt: Moeda atualizada para {currencyCode}
ru: Валюта обновлена на {currencyCode}
zh: 货币已更新为 {currencyCode}

# welcomeTo
source: Welcome to uBillz!
ar: !uBillz أهلاً بك في
es: ¡Bienvenido a uBillz!
hi: uBillz में आपका स्वागत है!
ja: uBillzへようこそ！
pt: Bem-vindo ao uBillz!
ru: Добро пожаловать в uBillz!
zh: 欢迎来到 uBillz！

# setupSecureAccess
source: Set up your secure access
ar: قم بإعداد وصولك الآمن
es: Configure su acceso seguro
hi: अपनी सुरक्षित पहुंच सेट करें
ja: 安全なアクセスを設定してください
pt: Configure seu acesso seguro
ru: Настройте безопасный доступ
zh: 设置您的安全访问

source: Your Name
ar: اسمك
es: Su nombre
hi: आपका नाम
ja: お名前
pt: Seu nome
ru: Ваше имя
zh: 您的名字

# errorEnterName
source: Please enter your name
ar: الرجاء إدخال اسمك
es: Por favor, ingrese su nombre
hi: कृपया अपना नाम दर्ज करें
ja: お名前を入力してください
pt: Por favor, insira seu nome
ru: Пожалуйста, введите ваше имя
zh: 请输入您的名字

# createPin
source: Create 4-digit PIN
ar: إنشاء رمز PIN مكون من 4 أرقام
es: Crear PIN de 4 dígitos
hi: 4-अंकीय पिन बनाएं
ja: 4桁のPINを作成
pt: Criar PIN de 4 dígitos
ru: Создайте 4-значный PIN-код
zh: 创建4位数PIN码

# errorPinLength
source: PIN must be exactly 4 digits
ar: يجب أن يتكون رمز PIN من 4 أرقام بالضبط
es: El PIN debe tener exactamente 4 dígitos
hi: पिन ठीक 4 अंकों का होना चाहिए
ja: PINは正確に4桁である必要があります
pt: O PIN deve ter exatamente 4 dígitos
ru: PIN-код должен состоять ровно из 4 цифр
zh: PIN码必须为4位数

# errorPinNumeric
source: PIN must contain only numbers
ar: يجب أن يحتوي رمز PIN على أرقام فقط
es: El PIN debe contener solo números
hi: पिन में केवल संख्याएँ होनी चाहिए
ja: PINには数字のみを含める必要があります
pt: O PIN deve conter apenas números
ru: PIN-код должен содержать только цифры
zh: PIN码必须只包含数字

source: Confirm PIN
ar: تأكيد رمز PIN
es: Confirmar PIN
hi: पिन की पुष्टि करें
ja: PINを確認
pt: Confirmar PIN
ru: Подтвердите PIN-код
zh: 确认PIN码

# errorPinMatch
source: PINs do not match
ar: رموز PIN غير متطابقة
es: Los PIN no coinciden
hi: पिन मेल नहीं खाते
ja: PINが一致しません
pt: Os PINs não correspondem
ru: PIN-коды не совпадают
zh: PIN码不匹配

# setupAuth
source: Setup Authentication
ar: إعداد المصادقة
es: Configurar autenticación
hi: प्रमाणीकरण सेट करें
ja: 認証を設定
pt: Configurar autenticação
ru: Настроить аутентификацию
zh: 设置认证

# dataStoredLocally
source: Your data is stored securely on your device only
ar: يتم تخزين بياناتك بشكل آمن على جهازك فقط
es: Sus datos se almacenan de forma segura solo en su dispositivo
hi: आपका डेटा केवल आपके डिवाइस पर सुरक्षित रूप से संग्रहीत है
ja: データはデバイスにのみ安全に保存されます
pt: Seus dados são armazenados com segurança apenas no seu dispositivo
ru: Ваши данные надежно хранятся только на вашем устройстве
zh: 您的数据仅安全地存储在您的设备上

# setupAuthFailed
source: Failed to setup authentication. Please try again.
ar: فشل إعداد المصادقة. يرجى المحاولة مرة أخرى.
es: Error al configurar la autenticación. Por favor, inténtelo de nuevo.
hi: प्रमाणीकरण सेट करने में विफल। कृपया पुनः प्रयास करें।
ja: 認証の設定に失敗しました。もう一度お試しください。
pt: Falha ao configurar a autenticação. Por favor, tente novamente.
ru: Не удалось настроить аутентификацию. Пожалуйста, попробуйте еще раз.
zh: 设置认证失败。请再试一次。

# setupError
source: Setup error: {error}
ar: خطأ في الإعداد: {error}
es: Error de configuración: {error}
hi: सेटअप त्रुटि: {error}
ja: 設定エラー：{error}
pt: Erro de configuração: {error}
ru: Ошибка настройки: {error}
zh: 设置错误：{error}

# biometricAuthEnabled
source: Biometric authentication enabled! You can use it on the next login.
ar: تم تمكين المصادقة بالبصمة! يمكنك استخدامها عند تسجيل الدخول التالي.
es: ¡Autenticación biométrica activada! Puede usarla en el próximo inicio de sesión.
hi: बायोमेट्रिक प्रमाणीकरण सक्षम! आप इसे अगले लॉगिन पर उपयोग कर सकते हैं।
ja: 生体認証が有効になりました！次回のログイン時に使用できます。
pt: Autenticação biométrica ativada! Você pode usá-la no próximo login.
ru: Биометрическая аутентификация включена! Вы можете использовать ее при следующем входе.
zh: 生物识别认证已启用！您可以在下次登录时使用。

# addPaymentTitle
source: Add Payment
ar: إضافة دفعة
es: Añadir Pago
hi: भुगतान जोड़ें
ja: 支払いを追加
pt: Adicionar Pagamento
ru: Добавить платеж
zh: 添加付款

# addPaymentHeader
source: Add a new payment to your list.
ar: أضف دفعة جديدة إلى قائمتك.
es: Añada un nuevo pago a su lista.
hi: अपनी सूची में एक नया भुगतान जोड़ें।
ja: リストに新しい支払いを追加します。
pt: Adicione um novo pagamento à sua lista.
ru: Добавьте новый платеж в свой список.
zh: 将新的付款添加到您的列表中。

source: Day of Month
ar: يوم من الشهر
es: Día del mes
hi: महीने का दिन
ja: 日
pt: Dia do mês
ru: День месяца
zh: 月份中的日期

source: Amount
ar: المبلغ
es: Monto
hi: राशि
ja: 金額
pt: Valor
ru: Сумма
zh: 金额

source: Description
ar: الوصف
es: Descripción
hi: विवरण
ja: 説明
pt: Descrição
ru: Описание
zh: 描述

# errorEnterDay
source: Please enter a day
ar: الرجاء إدخال يوم
es: Por favor, ingrese un día
hi: कृपया एक दिन दर्ज करें
ja: 日を入力してください
pt: Por favor, insira um dia
ru: Пожалуйста, введите день
zh: 请输入日期

# errorInvalidDay
source: Please enter a day between 1 and 31
ar: الرجاء إدخال يوم بين 1 و 31
es: Por favor, ingrese un día entre 1 y 31
hi: कृपया 1 और 31 के बीच एक दिन दर्ज करें
ja: 1から31の間の数値を入力してください
pt: Por favor, insira um dia entre 1 e 31
ru: Пожалуйста, введите день от 1 до 31
zh: 请输入1到31之间的日期

# errorEnterAmount
source: Please enter an amount
ar: الرجاء إدخال مبلغ
es: Por favor, ingrese un monto
hi: कृपया एक राशि दर्ज करें
ja: 金額を入力してください
pt: Por favor, insira um valor
ru: Пожалуйста, введите сумму
zh: 请输入金额

# errorInvalidAmount
source: Please enter a valid amount
ar: الرجاء إدخال مبلغ صالح
es: Por favor, ingrese un monto válido
hi: कृपया एक वैध राशि दर्ज करें
ja: 有効な金額を入力してください
pt: Por favor, insira um valor válido
ru: Пожалуйста, введите действительную сумму
zh: 请输入有效金额

# errorEnterDescription
source: Please enter a description
ar: الرجاء إدخال وصف
es: Por favor, ingrese una descripción
hi: कृपया एक विवरण दर्ज करें
ja: 説明を入力してください
pt: Por favor, insira uma descrição
ru: Пожалуйста, введите описание
zh: 请输入描述

# paymentAddedSuccess
source: Payment added successfully!
ar: تمت إضافة الدفعة بنجاح!
es: ¡Pago añadido con éxito!
hi: भुगतान सफलतापूर्वक जोड़ा गया!
ja: 支払いが正常に追加されました！
pt: Pagamento adicionado com sucesso!
ru: Платеж успешно добавлен!
zh: 付款已成功添加！

# paymentAddedError
source: Failed to add payment. Please try again.
ar: فشل إضافة الدفعة. يرجى المحاولة مرة أخرى.
es: Error al añadir el pago. Por favor, inténtelo de nuevo.
hi: भुगतान जोड़ने में विफल। कृपया पुनः प्रयास करें।
ja: 支払いの追加に失敗しました。もう一度お試しください。
pt: Falha ao adicionar pagamento. Por favor, tente novamente.
ru: Не удалось добавить платеж. Пожалуйста, попробуйте еще раз.
zh: 添加付款失败。请再试一次。

source: Paid
ar: مدفوع
es: Pagado
hi: भुगतान किया गया
ja: 支払い済み
pt: Pago
ru: Оплачено
zh: 已付

source: Unpaid
ar: غير مدفوع
es: No pagado
hi: अवैतनिक
ja: 未払い
pt: Não pago
ru: Неоплачено
zh: 未付

source: English
ar: الإنجليزية
es: Inglés
hi: अंग्रेज़ी
ja: 英語
pt: Inglês
ru: Английский
zh: 英语

source: French
ar: الفرنسية
es: Francés
hi: फ़्रेंच
ja: フランス語
pt: Francês
ru: Французский
zh: 法语

source: Spanish
ar: الإسبانية
es: Español
hi: स्पेनिश
ja: スペイン語
pt: Espanhol
ru: Испанский
zh: 西班牙语

source: Mandarin Chinese
ar: الماندرين الصينية
es: Chino Mandarín
hi: मंदारिन चीनी
ja: 中国語（標準）
pt: Chinês Mandarim
ru: Китайский (Мандарин)
zh: 普通话

source: Hindi
ar: الهندية
hi: हिंदी
ja: ヒンディー語
ru: Хинди
zh: 印地语

source: Arabic
ar: العربية
es: Árabe
hi: अरबी
ja: アラビア語
pt: Árabe
ru: Арабский
zh: 阿拉伯语

source: German
ar: الألمانية
es: Alemán
hi: जर्मन
ja: ドイツ語
pt: Alemão
ru: Немецкий
zh: 德语

source: Portuguese
ar: البرتغالية
es: Portugués
hi: पुर्तगाली
ja: ポルトガル語
pt: Português
ru: Португальский
zh: 葡萄牙语

source: Russian
ar: الروسية
es: Ruso
hi: रूसी
ja: ロシア語
pt: Russo
ru: Русский
zh: 俄语

source: Japanese
ar: اليابانية
es: Japonés
hi: जापानी
ja: 日本語
pt: Japonês
ru: Японский
zh: 日语

# payday
source: Budget Day
ar: يوم الميزانية
es: Día de presupuesto
hi: बजट दिवस
ja: 予算日
pt: Dia do orçamento
ru: День бюджета
zh: 预算日

source: Day
ar: يوم
es: Día
hi: दिन
ja: 日
pt: Dia
ru: День
zh: 日

source: Username Settings
ar: إعدادات اسم المستخدم
es: Configuración de nombre de usuario
hi: उपयोगकर्ता नाम सेटिंग्स
ja: ユーザー名設定
pt: Configurações de nome de usuário
ru: Настройки имени пользователя
zh: 用户名设置

source: Update Your Username
ar: تحديث اسم المستخدم
es: Actualizar nombre de usuario
hi: अपना उपयोगकर्ता नाम अपडेट करें
ja: ユーザー名を更新
pt: Atualizar seu nome de usuário
ru: Обновить имя пользователя
zh: 更新您的用户名

# usernameDescription
source: Change the name that appears in your dashboard greeting.
ar: قم بتغيير الاسم الذي يظهر في تحية لوحة التحكم.
es: Cambie el nombre que aparece en el saludo de su panel.
hi: वह नाम बदलें जो आपके डैशबोर्ड अभिवादन में दिखाई देता है।
ja: ダッシュボードの挨拶に表示される名前を変更します。
pt: Altere o nome que aparece na saudação do seu painel.
ru: Измените имя, которое отображается в приветствии на панели управления.
zh: 更改仪表板问候语中显示的名字。

source: Update Username
ar: تحديث اسم المستخدم
es: Actualizar nombre de usuario
hi: उपयोगकर्ता नाम अपडेट करें
ja: ユーザー名を更新
pt: Atualizar nome de usuário
ru: Обновить имя пользователя
zh: 更新用户名

# usernameUpdatedSuccess
source: Username updated successfully!
ar: تم تحديث اسم المستخدم بنجاح!
es: ¡Nombre de usuario actualizado con éxito!
hi: उपयोगकर्ता नाम सफलतापूर्वक अपडेट हो गया!
ja: ユーザー名が正常に更新されました！
pt: Nome de usuário atualizado com sucesso!
ru: Имя пользователя успешно обновлено!
zh: 用户名更新成功！

# usernameUpdateError
source: Failed to update username. Please try again.
ar: فشل تحديث اسم المستخدم. يرجى المحاولة مرة أخرى.
es: Error al actualizar el nombre de usuario. Por favor, inténtelo de nuevo.
hi: उपयोगकर्ता नाम अपडेट करने में विफल। कृपया पुनः प्रयास करें।
ja: ユーザー名の更新に失敗しました。もう一度お試しください。
pt: Falha ao atualizar o nome de usuário. Por favor, tente novamente.
ru: Не удалось обновить имя пользователя. Пожалуйста, попробуйте еще раз.
zh: 更新用户名失败。请再试一次。

# nextPayday
source: My Budget Day is Day {day}
ar: يوم ميزانيتي هو اليوم {day}
es: Mi día de presupuesto es el día {day}
hi: मेरा बजट दिवस दिन {day} है
ja: 私の予算日は{day}日です
pt: Meu dia do orçamento é o dia {day}
ru: Мой день бюджета - день {day}
zh: 我的预算日是第{day}天

# paydayDay
source: Budget Day: Day {day}
ar: يوم الميزانية: اليوم {day}
es: Día de presupuesto: Día {day}
hi: बजट दिवस: दिन {day}
ja: 予算日：{day}日
pt: Dia do orçamento: Dia {day}
ru: День бюджета: День {day}
zh: 预算日：第 {day} 天
